# NumberOfTargets Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..NumberOfTargets Property
RebarConstraint Class See Also
---
Identifies the number of references associated to the rebar handle.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public int NumberOfTargets { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfTargets As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfTargets {
	int get ();
}
```

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace